Repository: AArnott/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading/xlf/Strings.*.xlf
Languages: ru

# AppliedSynchronizationContextNotAllowed
source: Acquiring locks on threads with a SynchronizationContext applied is not allowed.
ru: Получение блокировок для потоков, к которым применен контекст SynchronizationContext, запрещено.

# CannotUpgradeNonUpgradeableLock
source: A non-upgradeable read lock is held by the caller and cannot be upgraded.
ru: Вызывающая сторона удерживает блокировку чтения, которую невозможно обновить.

# DangerousReadLockRequestFromWriteLockFork
source: Dangerous request for read lock from fork of write lock.
ru: Опасный запрос на блокировку чтения из-за ветвления блокировки записи.

# FrameMustBePushedFirst
source: This instance must be pushed first.
ru: Этот экземпляр необходимо отправить первым.

# InvalidAfterCompleted
source: Already transitioned to the Completed state.
ru: Уже выполнен переход в состояние "Выполнено".

# InvalidLock
source: This operation can only be executed against a valid lock.
ru: Эта операция может быть выполнена только применительно к допустимой блокировке.

# InvalidWithoutLock
source: A lock is required.
ru: Необходима блокировка.

# JoinableTaskContextAndCollectionMismatch
source: JoinableTask does not belong to the context this collection was instantiated with.
ru: JoinableTask не относится к контексту, в котором был создан экземпляр этой коллекции.

# JoinableTaskContextNodeAlreadyRegistered
source: This node already registered.
ru: Этот узел уже зарегистрирован.

# LazyValueFaulted
source: Lazily created value faulted during construction.
ru: Созданное "лениво" значение вызвало сбой во время работы конструктора.

# LazyValueNotCreated
source: Lazily created value not yet constructed.
ru: Созданное "лениво" еще не сконструировано.

# LockCompletionAlreadyRequested
source: This lock has already been marked for completion. No new top-level locks can be serviced.
ru: Эта блокировка уже помечена для завершения. Не удается обслужить новые блокировки верхнего уровня.

# MultipleContinuationsNotSupported
source: Multiple continuations are not supported.
ru: Использование нескольких продолжений не поддерживается.

# NotAllowedUnderURorWLock
source: This operation is not allowed while holding an active upgradeable read or write lock from an AsyncReaderWriterLock.
ru: Эта операция не допускается во время удержания активной обновляемой блокировки чтения или записи от AsyncReaderWriterLock.

# PushFromWrongThread
source: Message pump can only be run from the original thread.
ru: Генератор сообщений может быть запущен только из исходного потока.

# QueueEmpty
source: The queue is empty.
ru: Очередь пуста.

# STAThreadCallerNotAllowed
source: This operation cannot be completed on an STA thread.
ru: Эту операцию нельзя выполнить применительно к потоку STA.

# SemaphoreAlreadyHeld
source: Semaphore is already held and reentrancy setting is '{0}'.
ru: Семафор уже существует, и параметр повторного вхождения имеет значение "{0}".

# SemaphoreMisused
source: This semaphore has been misused and can no longer be used.
ru: Этот семафор был использован ненадлежащим образом и больше не может использоваться.

# SemaphoreStackNestingViolated
source: Nested semaphore requests must be released in LIFO order when the reentrancy setting is: '{0}'
ru: Вложенные запросы к семафорам должны освобождаться в порядке LIFO, если параметр повторного вхождения имеет значение: '{0}'

# SwitchToMainThreadFailedToReachExpectedThread
source: An attempt to switch to the main thread failed to reach the expected thread. Was the JoinableTaskContext initialized on the wrong thread or with a SynchronizationContext whose Post method does not execute its delegate on the main thread?
ru: При попытке переключиться на основной поток не удалось достичь ожидаемого потока. Был ли JoinableTaskContext инициализирован в неправильном потоке или с помощью SynchronizationContext, чей метод POST не выполняет свой делегат в основном потоке?

# SyncContextFrameMismatchedAffinity
source: This frame has already been used with a different instance.
ru: Этот кадр уже используется с другим экземпляром.

# SyncContextNotSet
source: No SynchronizationContext to reach the main thread has been set.
ru: Не задан SynchronizationContext для доступа к главному потоку.

# ValueFactoryReentrancy
source: The value factory has called for the value on the same instance.
ru: Фабрика значений вызвала значение в том же экземпляре.

# WriteLockOutlived
source: Write lock out-lived by a nested read lock, which is not allowed.
ru: Длительность вложенной блокировки чтения превысила длительность блокировки записи, что недопустимо.
